# 4/17

In [17]:
import requests
import json
import pandas as pd

In [18]:
response = requests.get('http://api.open-notify.org/astros.json')

In [19]:
print(response.status_code)

200

In [20]:
data = response.json()

In [21]:
data

{'number': 7,
 'message': 'success',
 'people': [{'name': 'Mark Vande Hei', 'craft': 'ISS'},
  {'name': 'Oleg Novitskiy', 'craft': 'ISS'},
  {'name': 'Pyotr Dubrov', 'craft': 'ISS'},
  {'name': 'Thomas Pesquet', 'craft': 'ISS'},
  {'name': 'Megan McArthur', 'craft': 'ISS'},
  {'name': 'Shane Kimbrough', 'craft': 'ISS'},
  {'name': 'Akihiko Hoshide', 'craft': 'ISS'}]}

In [22]:
data['people']

[{'name': 'Mark Vande Hei', 'craft': 'ISS'},
 {'name': 'Oleg Novitskiy', 'craft': 'ISS'},
 {'name': 'Pyotr Dubrov', 'craft': 'ISS'},
 {'name': 'Thomas Pesquet', 'craft': 'ISS'},
 {'name': 'Megan McArthur', 'craft': 'ISS'},
 {'name': 'Shane Kimbrough', 'craft': 'ISS'},
 {'name': 'Akihiko Hoshide', 'craft': 'ISS'}]

In [23]:
data['people'][0]

{'name': 'Mark Vande Hei', 'craft': 'ISS'}

In [27]:
pddata = data['people']

In [35]:
fm = json.dumps(pddata)

In [24]:
# IDK about doing this try PANDAS to format the data
formatted = json.dumps(data, sort_keys = True, indent = 15)

In [25]:
formatted

'{\n               "message": "success",\n               "number": 7,\n               "people": [\n                              {\n                                             "craft": "ISS",\n                                             "name": "Mark Vande Hei"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Oleg Novitskiy"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Pyotr Dubrov"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Thomas Pesquet"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Megan McArthur"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Shane Kimbrough"\n                              },\n                              {\n                                             "craft": "ISS",\n                                             "name": "Akihiko Hoshide"\n                              }\n               ]\n}'

### Try With PANDAS

### Remember to dump the json 1st!!!

In [32]:
df = pd.read_json(formatted, orient = 'records')

In [33]:
df

   message  number                                       people
0  success       7   {'craft': 'ISS', 'name': 'Mark Vande Hei'}
1  success       7   {'craft': 'ISS', 'name': 'Oleg Novitskiy'}
2  success       7     {'craft': 'ISS', 'name': 'Pyotr Dubrov'}
3  success       7   {'craft': 'ISS', 'name': 'Thomas Pesquet'}
4  success       7   {'craft': 'ISS', 'name': 'Megan McArthur'}
5  success       7  {'craft': 'ISS', 'name': 'Shane Kimbrough'}
6  success       7  {'craft': 'ISS', 'name': 'Akihiko Hoshide'}

In [36]:
df1 = pd.read_json(fm)

In [37]:
df1

              name craft
0   Mark Vande Hei   ISS
1   Oleg Novitskiy   ISS
2     Pyotr Dubrov   ISS
3   Thomas Pesquet   ISS
4   Megan McArthur   ISS
5  Shane Kimbrough   ISS
6  Akihiko Hoshide   ISS